topics/rStudioWinMacFirstSteps.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-08-23 Sun 05:20 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>First Steps in Programming and Markdown: RStudio</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Britt Anderson" />
</head>
<body>
<div id="content">
<h1 class="title">First Steps in Programming and Markdown: RStudio</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgef82bf2">1. Goal</a></li>
<li><a href="#org6fb3617">2. Summary of Steps</a></li>
<li><a href="#org8d57015">3. Detailed Steps</a>
<ul>
<li><a href="#org39deb3c">3.1. Download R</a></li>
<li><a href="#orgf9d7388">3.2. Download RStudio</a></li>
<li><a href="#org2954807">3.3. Verify they are working.</a></li>
<li><a href="#org38954a7">3.4. Generate and Rmd file; Try some simple programming; export a webpage</a>
<ul>
<li><a href="#org28f7c4c">3.4.1. Variable</a></li>
<li><a href="#orge7f505d">3.4.2. Loops</a></li>
<li><a href="#org4c701c1">3.4.3. Functions</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgef82bf2" class="outline-2">
<h2 id="orgef82bf2"><span class="section-number-2">1</span> Goal</h2>
<div class="outline-text-2" id="text-1">
<p>
Our eventual goal is to do all the above in Linux. But in order to make some progress with our programming practice while we puzzle our way through the <a href="installUbuntu.html">Linux installation instructions</a> we will begin by using a tool easily accessible in Windows and on Macs for using the programming language R, common for statistical analyses, and RStudio a programming environment that uses R and facilitates our first steps in learning to integrate code with text for integrated report generation.
</p>
</div>
</div>
<div id="outline-container-org6fb3617" class="outline-2">
<h2 id="org6fb3617"><span class="section-number-2">2</span> Summary of Steps</h2>
<div class="outline-text-2" id="text-2">
<p>
We will: 
</p>
<ol class="org-ol">
<li>Download R (<a href="https://vimeo.com/450719112">downloadR video</a>)</li>
<li>Download RStudio (<a href="https://vimeo.com/450719047">downloadRStudio video</a>)</li>
<li>Verify they are working (<a href="https://vimeo.com/450719009">RStudio Walk-through video</a>)</li>
<li>Generate a simple Rmd file to see some of the basic components of the markdown syntax (<a href="https://vimeo.com/450718879">simpleRmdDemo video</a>)</li>
<li>Add some simple computing constructs including a 
<ul class="org-ul">
<li>variable</li>
<li>for loop</li>
<li>function</li>
</ul></li>
<li>Produce an Rmd file from the above</li>
<li>And export it to an html file that we can open in a web browser and that displays correctly.</li>
</ol>
</div>
</div>
<div id="outline-container-org8d57015" class="outline-2">
<h2 id="org8d57015"><span class="section-number-2">3</span> Detailed Steps</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org39deb3c" class="outline-3">
<h3 id="org39deb3c"><span class="section-number-3">3.1</span> Download R</h3>
<div class="outline-text-3" id="text-3-1">
<p>
R is free statistical software. As it is a very popular language of academic statisticians many new and cutting edge statistical techniques are avaialable for R users that are well vetted. If you are using linux you can usually find instructions for downloading and installing that are specific to your linux distribution and its package manager. The comprehensive R network (<a href="https://cran.r-project.org/">CRAN</a>) also maintains download links and instructions and this is the right place to go for <a href="https://cran.r-project.org/bin/windows/">Windows</a> and <a href="https://cran.r-project.org/bin/macosx/">Mac</a> downloads.
</p>

<p>
The CRAN webpage also has links to <a href="https://cran.r-project.org/manuals.html">manuals</a> that are useful for learning more about the language and its functions. While there is great material elsewhere, and you can find it by internet searches, it is still advisable to start at CRAN first. You know that information is curated by the body that funds, develops, and supports the language. 
</p>
</div>
</div>
<div id="outline-container-orgf9d7388" class="outline-3">
<h3 id="orgf9d7388"><span class="section-number-3">3.2</span> Download RStudio</h3>
<div class="outline-text-3" id="text-3-2">
<p>
RStudio is not R. It is a development environment wrapped around R. You can absolutely use R without RStudio (that is the way I use it and what I recommend). RStudio provides a lot of help to get a beginner started, and I used it as a beginner too, but it also reflects the opinions of the RStudio developers about their preferred way of using the language and the packages they think are best, but which may not be exactly what you want or how you want to use the tool. So, while I recommend RStudio to get going you should also try other ways to use R, and other styles of using R before you decide on your preferred approach. The people who make RStudio have a free desktop version that will provide all the functionality that we will need. They also make commercial tools that build on the basic RStudio functionality. 
<a href="https://rstudio.com/products/rstudio/download/#download">Here</a> is where you can get RStudio. Choose the right version for your operating system and follow the instructions. 
</p>
</div>
</div>
<div id="outline-container-org2954807" class="outline-3">
<h3 id="org2954807"><span class="section-number-3">3.3</span> Verify they are working.</h3>
<div class="outline-text-3" id="text-3-3">
<p>
Just click the icon and try to open the software. If it starts it works.
</p>
</div>
</div>
<div id="outline-container-org38954a7" class="outline-3">
<h3 id="org38954a7"><span class="section-number-3">3.4</span> Generate and Rmd file; Try some simple programming; export a webpage</h3>
<div class="outline-text-3" id="text-3-4">
<p>
RStudio supports several different ways of interacting with R. We will use the Rmd file, which stands for R Mark Down; R because we are using the R language for our programming, and markdown because we are using the R markdown syntax (there are other varieties of markdown with slight differences in syntax and functions) for telling RStudio how to format our export file when it runs the code and reads our program. We will use this below to make the file we open in our browser. 
</p>

<p>
A <a href="https://vimeo.com/450718879">video</a> shows an example. If you practice without watching the video pay attention to the difference between the <i>editor</i> window and the <i>console</i>. The console evaluates the code and prints out the answer. You can use it to test whether your R code does what you think. The editor is where you mix the code with text. It lies static until you tell it to run a line, a block, or the entire document. It will then ouput the result (if there were no errors that you have to fix) in a viewer that in internal to RStudio. You want to be able to save that output somewhere (or know where RStudio saves it). Then you can open that file in your browser to see the full power of being able to write a simple text file and get produced a fully featured web page. 
</p>
</div>
<div id="outline-container-org28f7c4c" class="outline-4">
<h4 id="org28f7c4c"><span class="section-number-4">3.4.1</span> Variable</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
A <b>variable</b> is something that holds a value. A value doesn't have to be a number. It could be name, character, or a list of pupil diameters, of even some larger data structure. As the name implies in R, as in most, but not all, programming languages a variable may vary. You could use a variable to "count" how many times you have done an operation and it would increment the value on each pass through the loop.
</p>

<div class="org-src-container">
<pre class="src src-R" id="orgb17c227">a = 3
a = a + 1
print(a)
</pre>
</div>

<pre class="example">
4
</pre>


<pre class="example">
4
</pre>
</div>
</div>
<div id="outline-container-orge7f505d" class="outline-4">
<h4 id="orge7f505d"><span class="section-number-4">3.4.2</span> Loops</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
Often we use programs to automate things that need to be done over and over again. In many statistical and experimental procedures this need for repetition is common. Consider running all the trials of an experiment of finding the mean reaction time for a large number of experimental participants. When you have a task to do that needs to run until some condition is met you will often use a <code>while</code> loop. When you need to do something for a set number of time or through a list of items then you will typically use a <code>for</code> loop. A <code>for</code> loop iterates through a structure and executes the same code, the code in the <i>body</i> of the loop each time through. 
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #a020f0;">for</span> (i <span style="color: #a020f0;">in</span> seq(1,10)) {
  print(i)
}
</pre>
</div>

<pre class="example">
[1] 1
[1] 2
[1] 3
[1] 4
[1] 5
[1] 6
[1] 7
[1] 8
[1] 9
[1] 10
</pre>
</div>
</div>
<div id="outline-container-org4c701c1" class="outline-4">
<h4 id="org4c701c1"><span class="section-number-4">3.4.3</span> Functions</h4>
<div class="outline-text-4" id="text-3-4-3">
<p>
Functions in programming languages are black boxes for taking input and returning output. You, the author of the function, fill in the details of the black box, but we users only know what we feed in and what we get back. Each programming language has its own way of telling the processor what is and what is not a function. In R we use the keyword <code>function</code> and assign that to a name that we can use for our convenience when we want to invoke that function. 
</p>

<p>
For example, let's say we want to know if a number is even. We can use R's built in function to tell us the remainder of a division. This function is an <i>infix</i> function as we put it INside its arguments. It uses the symbols <code>%%</code>. For example ~ 5 %% 2~ equals 1 because if you divide 5 by 2 you have 1 left over. 
</p>

<p>
To know if a number is odd or even we only need to know if the remainder when divided by two is or is not zero. To do this we can use a <b>predicate</b>. It is a conventional way of saying it is a test that comes back true or false depending on whether a condition is met. Putting this altogether we can write a function that evaluates if a number is odd. 
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #0000ff;">isOdd</span> <span style="color: #008b8b;">&lt;-</span> <span style="color: #a020f0;">function</span>(n) {
           <span style="color: #a020f0;">return</span>(n %% 2 != 0)
}
</pre>
</div>

<p>
And then we can use our function in a test:
</p>

<div class="org-src-container">
<pre class="src src-R">print(isOdd(5))
</pre>
</div>

<pre class="example">
[1] TRUE
</pre>


<p>
We could then use this output value to test whether to print the number by using an "if" statement. Note that some of the syntax I am using in this file to get R to work is special to orgmode and not RStudio. You will see a demo of the same idea with RStudio in the videos for this topic. 
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2020-08-23 Sun 05:20</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
